tap "homebrew/services"
# Official Amazon AWS command-line interface
brew "awscli"
# Cross-platform make
brew "cmake"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Text to speech, software speech synthesizer
brew "espeak"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Open source, general-purpose policy engine
brew "opa"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Rsync for cloud storage
brew "rclone"
# Terminal multiplexer
brew "tmux"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@anthropic-ai/claude-code"
npm "@qwen-code/qwen-code"
npm "@skhatri/generator-mcp"
npm "@skhatri/github-mcp"
